src/InformationRegisters/НумераторГрузовоеМесто/НумераторГрузовоеМесто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НумераторГрузовоеМесто</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НумераторГрузовоеМесто/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает следующий номер для грузового места в указанном году.
//
// Параметры:
//  Год - Число - Год, для которого необходимо получить следующий номер.
//
// Возвращаемое значение:
//  Число - Следующий номер для грузового места в указанном году.
//
Функция ПолучитьСледующий(Год) Экспорт
	Перем НачалиТранзакцию;
	
	Если Не ТранзакцияАктивна() Тогда
		НачатьТранзакцию();
		НачалиТранзакцию = Истина;
	Иначе
		НачалиТранзакцию = Ложь;
	КонецЕсли;
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НумераторГрузовоеМесто");
		ЭлементБлокировки.УстановитьЗначение("Год", Год);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
	Исключение
		Если НачалиТранзакцию Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	ЗаписьПоГоду = СоздатьМенеджерЗаписи();
	ЗаписьПоГоду.Год = Год;
	ЗаписьПоГоду.Прочитать();

	Если ЗаписьПоГоду.Выбран() Тогда
		ЗаписьПоГоду.Номер = ЗаписьПоГоду.Номер + 1;
	Иначе
		ЗаписьПоГоду.Год = Год;
		ЗаписьПоГоду.Номер = 1;
	КонецЕсли;

	ЗаписьПоГоду.Записать();
	
	Если НачалиТранзакцию Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Возврат СтрШаблон("%1%2", Формат(Год, "ЧГ=0;"), Формат(ЗаписьПоГоду.Номер, "ЧЦ=4; ЧВН=; ЧГ=0;"));
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
